<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Cursor AI.</string>
	<key>Identifier</key>
    	<string>com.github.joeborner.pkg.cursorai</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>cursorai</string>
	</dict>
	<key>Process</key>
	<array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>https://downloads.cursor.com/production/([0-9A-Z]+)/darwin/universal/Cursor-darwin-universal.dmg</string>
				<key>result_output_var_name</key>
				<string>URL</string>
				<key>url</key>
				<string>https://www.cursor.com/api/download?platform=darwin-universal&releaseTrack=stable</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>url</key>
				<string>https://downloads.cursor.com/production/%URL%/darwin/universal/Cursor-darwin-universal.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
