<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of kpkg.</string>
	<key>Identifier</key>
    	<string>com.github.joeborner.pkg.kpkg</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>kpkg</string>
	</dict>
	<key>Process</key>
	<array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>v([0-9\.]+)</string>
				<key>result_output_var_name</key>
				<string>VERSION</string>
				<key>url</key>
				<string>https://github.com/kandji-inc/kpkg/releases/latest</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%VERSION%.pkg</string>
				<key>url</key>
				<string>https://github.com/kandji-inc/kpkg/releases/download/%URL%/%NAME%-%VERSION%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	        <dict>
	            <key>Processor</key>
	            <string>Copier</string>
	            <key>Arguments</key>
	            <dict>
	                <key>source_path</key>
	                <string>downloads/%NAME%-%VERSION%.pkg</string>
	                <key>destination_path</key>
	                <string>%pkgroot%</string>
	            </dict>
	        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
